{
  "customgamerules.edit": "Edit Gamerules",
  "customgamerules.search": "Search",
  "customgamerules.reset": "Reset",
  "customgamerules.mod.unknown": "Unknown",
  "gamerule.minecraft.announceAdvancements.desc": "Whether advancements should be announced in chat.",
  "gamerule.minecraft.commandBlockOutput.desc": "Whether command blocks should notify admins when they perform commands.",
  "gamerule.minecraft.disableElytraMovementCheck.desc": "Whether the server should skip checking player speed when the player is wearing elytra. Often helps with jittering due to lag in multiplayer, but may also be used to travel unfairly long distances in survival mode (cheating).",
  "gamerule.minecraft.doDaylightCycle.desc": "Whether the day-night cycle and moon phases progress.",
  "gamerule.minecraft.doEntityDrops.desc": "Whether entities that are not mobs should have drops.",
  "gamerule.minecraft.doFireTick.desc": "Whether fire should spread and naturally extinguish.",
  "gamerule.minecraft.doLimitedCrafting.desc": "Whether players should only be able to craft recipes that they've unlocked first.",
  "gamerule.minecraft.doMobLoot.desc": "Whether mobs should drop items.",
  "gamerule.minecraft.doMobSpawning.desc": "Whether mobs should naturally spawn. Does not affect monster spawners.",
  "gamerule.minecraft.doTileDrops.desc": "Whether blocks should have drops.",
  "gamerule.minecraft.doWeatherCycle.desc": "Whether the weather will change.",
  "gamerule.minecraft.keepInventory.desc": "Whether the player should keep items in their inventory after death.",
  "gamerule.minecraft.logAdminCommands.desc": "Whether to log admin commands to server log.",
  "gamerule.minecraft.maxCommandChainLength.desc": "Determines the number at which the chain command block acts as a \"chain\".",
  "gamerule.minecraft.maxEntityCramming.desc": "The maximum number of other pushable entities a mob or player can push, before taking 3 suffocation damage per half-second. Setting to 0 disables the rule.",
  "gamerule.minecraft.mobGriefing.desc": "Whether mobs should be able to change blocks and whether mobs can pick up items.",
  "gamerule.minecraft.naturalRegeneration.desc": "Whether the player can regenerate health naturally if their hunger is full enough (doesn't affect external healing, such as golden apples, the Regeneration effect, etc.).",
  "gamerule.minecraft.randomTickSpeed.desc": "How often a random block tick occurs (such as plant growth, leaf decay, etc.) per chunk section per game tick. 0 will disable random ticks, higher numbers will increase random ticks.",
  "gamerule.minecraft.reducedDebugInfo.desc": "Whether the debug screen shows all or reduced information; and whether the effects of F3+B (entity hitboxes) and F3+G (chunk boundaries) are shown.",
  "gamerule.minecraft.sendCommandFeedback.desc": "Whether the feedback from commands executed by a player should show up in chat. Also affects the default behavior of whether command blocks store their output text.",
  "gamerule.minecraft.showDeathMessages.desc": "Whether death messages are put into chat when a player dies. Also affects whether a message is sent to the pet's owner when the pet dies.",
  "gamerule.minecraft.spawnRadius.desc": "The number of blocks outward from the world spawn coordinates that a player will spawn in when first joining a server or when dying without a personal spawnpoint.",
  "gamerule.minecraft.spectatorsGenerateChunks.desc": "Whether players in spectator mode can generate chunks."
}